{
	// GENERIC DIALOGUE
	
	// RAINY DAY DIALOGUE
	"dialogue.rain.1": "It's raining pretty hard today...$2#$b#Rain makes my body ache. I may turn in early today.$2",
	"dialogue.rain.2": "This weather is awful, but at least you don't need to water your crops today.#$b#Oh, but...do take care, there could be lighting strikes.",
	"dialogue.rain.3": "Ah! @, you're soaked!#$b#Here--have a seat and warm up a bit. You can head back out when you feel better.",
	
	// MARRIAGE DIALOGUE
	"dialogue.afterWedding": "It still doesn't quite feel real...but it is.$4#$b#We're married now...my beloved @ is now my ${husband^wife^spouse}$.$4#$b#I hope that we can enjoy many happy years together.$4",
	"dialogue.stardrop": "@, my dearest...#$b#You've been working incredibly hard, haven't you?$#b#But, despite that, you still went out of your way to help someone like me.#$b#It isn't much, compared to what you've done for me...but I want you to have this.$4#$b#May our love endure even the stars fading from the skies.$1",
	"dialogue.clutter": "Ah...@?$2#$b#I didn't want to say anything, but...the house is becoming a bit...stifling.$2#$b#Do you need me to help clean...?$2",
	"dialogue.monsters": "AUGH!!#$b#@, what's going on?! Why are there monsters--#$b#*cough cough!* *cough!*$3#$b#H-help!$3",
	
	// CONVERSATION TOPICS
	"dialogue.intro": "Sorry for that rather unseemly first impression...$2#$b#I suppose I got too excited to see someone in my grove. It's been a long time.#$b#I hope that you aren't too frightened by it.",
	"dialogue.cc.boulder": "I saw some glimmering stones drifting through the stream this morning.#$b#I wonder where they're coming from...",
	"dialogue.cc.bridge": "My friends tell me that they repaired the bridge in the mountains.#$b#Do be careful, though...the caves there can be a bit dangerous.",
	"dialogue.cc.bus": "My friends tell me that they repaired the bus. Wasn't there someone in the village who used to drive it?#$e#I wonder what the desert is like...",
	"dialogue.cc.greenhouse": "My friends tell me that they gave you a small gift last night.$1#$b#A greenhouse of your own...you could grow whatever you wanted there.",
	"dialogue.cc.minecart": "It's been rather noisy lately, and there's a strange smell in the air...",
	"dialogue.cc.complete": "So...my friends have departed, it seems.$2#$b#Ah...no, I shouldn't be so saddened. You did a wonderful thing for them, @.#$b#I'm glad that they can return home.#$e#%Aelin looks a bit sad. Best to leave him be for now.",
	"dialogue.theater": "A \"movie theater\"...I can't say I'm too familiar with the concept, but if the village likes it...",
	"dialogue.upgrade": "I heard that someone helped to build a house for Miss Pam and Miss Penny.#$b#I wonder who that could be...$1",
	"dialogue.upgradeAnon": "I heard that someone helped to build a house for Miss Pam and Miss Penny.",
	"dialogue.greenRain1": "Ah...the rain feels filled with the essence of nature.#$b#Perhaps I'll go for a small walk today...",
	"dialogue.greenRain2": "Mm, the air smells like the grandest forest one can imagine today. The rain is full of life.",
	"dialogue.greenRainFinish": "I feel surprisingly full of energy today. Perhaps it was that strange weather yesterday?",
	
	// MODDED CTS
	"dialogue.lucikiel1": "I felt a truly horrible darkness within the valley recently...$2#$b#Are you alright, @?$2",
	"dialogue.lucikiel2": "For much of my life, I have considered demons to be a blight upon the world.#$b#But...perhaps this one isn't so bad.",
	"dialogue.keahi": "Um...@...$2#$b#I didn't want to say it earlier, but...$2#$b#You smell quite awful.$2#$e#Please go take a bath.$2",
	"dialogue.cats1": "The cutest little cats came to visit me today, but...$2#$b#I found them because there was a dreadful amount of yelling.#$b#The orange one...Jorts? Somehow his head wound up stuck in my watering can.$2",
	"dialogue.cakewalk": "My little friends told me about a \"cake walk\" in town.#$b#It isn't much, but I had them slip a small honey cake into the offerings.$1",
	"dialogue.bride": "Did you hear the scream last night, @?$2#$b#It sent a terrible chill down my spine...$2",
	"dialogue.morris": "That greedy man who operated that selfish store is back, it seems.#$b#...The less I say about him, the better.",
	"dialogue.earthquake": "Ugh...that earthquake last night was horrible.$2#$b#Is your farm okay, @? Nothing was damaged, right?",
	"dialogue.jojaLightning": "That sound...as if the heavens had opened up and unleashed nature's fury...$2#$b#What in Yoba's name happened...?",
	"dialogue.leo": "I heard there is a new arrival in the village. I hope their time here will be pleasant.",
	"dialogue.babyBoy": "Congratulations, @! I hear you're going to be a ${father^mother^parent}$!$1#$b#May your child know always the blessings of nature, and live a long and happy life!$1",
	"dialogue.babyGirl": "Congratulations, @! I hear you're going to be a ${father^mother^parent}$!$1#$b#May your child know always the blessings of nature, and live a long and happy life!$1",
	"dialogue.wedding": "Congratulations, @. May you and %spouse enjoy many years together.$1",
	"dialogue.luauBest": "It seems everyone really loved the soup! I'm sure your contribution was the most important.$1#$b#Me? Ah...I didn't have any, in case there was fish.",
	"dialogue.luauShorts": "Um...@?#$b#You...wouldn't know anything about the shorts in the soup, would you...?",
	"dialogue.luauPoisoned": "I'm a bit glad I didn't partake in the soup...$2#$b#It seems everyone got quite sick. What in the world was in it, anyway?",
	"dialogue.trickOrTreat": "Jas and Vincent came to my cottage to deliver some sweets to me.$1#$b#I'm a bit worried that they traveled here alone, but it was quite a nice surprise.",
	"dialogue.itTakesAVillage": "Miss Penny and the others have worked so hard to ensure Jas and Vincent receive a proper education.#$b#They truly are unsung heroes in the village.$1",
	"dialogue.toshinori": "Toshinori...he was a good man.$2#$b#I'll offer a prayer to the spirits for him. May he rest peacefully.$2",
	"dialogue.creepyCats": "Perhaps it was my imagination, but I saw a shadow in the woods last night...$2#$b#It looked like a cat, but...$2",
	
	// SPECIAL DIALOGUE
	"dialogue.breakup": "W...what?#$b#%firstnameletter...@...#$b#I...I understand.$2#$b#Even if it was just a fleeting dream...that joy I felt was real.$2#$b#I hope that whatever comes in your future, you'll be happy.$2#$e#%Aelin avoids your gaze.",
	"dialogue.divorce": "...leave me alone. Your cruelty is unfathomable.$5#$e#%Aelin glares at you for a moment, before looking away.",
	"dialogue.trash": "Um...@? What are you doing...?"

	// EVENTS
	
	// GIFTS
	"gifts.love": "A-are you sure I can have this, @? Thank you so much!",
	"gifts.like": "Oh, thank you! I really appreciate this.",
	"gifts.dislike": "Um...I suppose I could hold onto this for you...",
	"gifts.hate": "@...? Do...do you hate me...?",
	"gifts.neutral": "Thank you.",
	"gifts.birthday": "You remembered my birthday? Thank you.$1",
	"gifts.birthday.positive": "Oh, my! You remembered! Thank you so much, @.$1",
	"gifts.birthday.negative": "This is...certainly a gift...$2",
	"gifts.stardropTea": "What a nostalgic aroma...ah, it's been quite some time since I enjoyed this.$1",
	"gifts.spicy": "Ah...spicy things tend to disagree with me...$2",
	"gifts.booze": "...this brings up some unpleasant memories of a very bad party, many centuries back...$2#$b#The less said about what happened that night, the better.$2",
	"gifts.honey": "Oh, this looks amazing...! The quality looks incredible. It almost feels a shame to take it...$1",
	"gifts.teaSet": "What beautiful craftsmanship! Would you like to have some tea with me to test the quality?$1",
	"gifts.poppy": "Poppies have fantastic medical use. I can never have too many of them.$1#$b#Now, if I could just grow them myself...$2",
	"gifts.sweetGemBerry": "I've tried for so long to cultivate one of these...are you sure I can have it?",
	"gifts.strawberry": "How did you know this was my favorite?$1",
	"gifts.redMushroom": "Um...@? Are you trying to poison me...?$2",
	"gifts.ancientFruit": "This little fruit has endured countless eons, and you managed to help it grow...#$b#Are you truly sure I can have this?",
	"gifts.greenTea": "Mm, such a soothing scent...I should have brought something to eat with this.$1",
	"gifts.pineapple": "Urf...mm...$2#$b#I don't think my mouth is supposed to feel like this, is it...?$3",
	"gifts.strawberryTea": "Thank you so much! Eugene must have taught you the recipe, didn't he? That little scamp!$1",
	"gifts.medicine": "Ah, you made some medicine for me?#$b#Thank you. It never hurts to have extra, just in case.",
	"gifts.flowers": "Oh, these flowers are beautiful...thank you, @.$1",
	"gifts.seeds": "Ah! You brought me some seeds! Hopefully I can get them to grow...$1",
	"dialogue.rejectGift.divorced": "Is this some kind of joke, @?$5#$b#You played with my heart and made me believe in happiness, and now you think you can buy it back?$5",

	// BOUQUET AND MERMAID PENDANT
	"dialogue.bouquet": "T-this...!#$b#A-are you sure, @...? You see me like that...?#$b#Well...okay...!$1#$b#I've wanted to ask you the same, but I've been too nervous.$4",
	"dialogue.bouquet.reject": "Erm...sorry, but I don't see you like that...$2",
	"dialogue.bouquet.reject.npcMarried": "O-oh, um...I'm flattered, @, truly, but...I'm already seeing {0}.$2",
	"dialogue.bouquet.reject.engaged": "@, did you hit your head in the mines...?#$b#We're due to marry already, silly.$4",
	"dialogue.bouquet.reject.married": "Is this your way of asking to renew our vows?$4#$b#Hehe. You're so silly.$1",
	"dialogue.bouquet.reject.divorced": "...$5#$b#%Aelin swats away the bouquet.#$e#You're unbelievable, @. Toying with my heart like that...$5",
	"dialogue.bouquet.reject.veryLow": "Erm...sorry, but I don't see you like that...$2",
	"dialogue.bouquet.reject.low": "Ah...#$b#...not right now. Maybe in the future, but...not right now.$2",
	"dialogue.pendant": "A...a mermaid pendant...#$b#These are exchanged as gifts between the villagers to ask for their hand in marriage...#$b#W-wait, does that mean, you...?#$b#Oh, @...! I accept...!$4",
	"dialogue.pendant.reject.engaged": "Ah? Another pendant...?#$b#Did you find another one in case I lost this one? Don't worry, it's not going anywhere.$4",
	"dialogue.pendant.reject.married": "Is this your way of asking to renew our vows?$4#$b#Hehe. You're so silly.$1",
	"dialogue.pendant.reject.divorced": "...$5#$b#%Aelin swats away the pendant.#$e#You're unbelievable, @. Toying with my heart like that...$5",
	"dialogue.pendant.reject.houseUpgrade": "O-oh!#$b#Um...I would love to, but...$2#$b#Well...the farmhouse seems a bit...small, doesn't it?#$b#It'd be a little too cramped for both of us...$2",
	"dialogue.pendant.reject.npcDating": "O-oh, um...I'm flattered, @, truly, but...I'm already seeing {0}.$2",
	"dialogue.pendant.reject.playerDating": "What the...?#$b#@, that's...that's cruel. You're already with someone.$2#$b#You'd break their heart like that...?$2",
	"dialogue.pendant.reject.eightHearts": "Ah...sorry, but...I don't think I'm ready yet.$2",
	"dialogue.pendant.reject.tenHearts": "Ah...sorry, but...I don't think I'm ready yet.$2#$b#It's all too scary.$2",
	"dialogue.pendant.reject.tenHearts2": "@, I already said...$2",
	
	// MAIL
	"mail.wizard.text": "Now that you have become one with nature, perhaps you would be interested to know the secret of Cindersap Forest: a presence known only to a very scant few, ephemeral and fleeting.^^Travel west of the forest, deep into the heart of the woods. There, you may find something of interest.^^   -M. Rasmodius, Wizard",
	"mail.wizard.name": "The Secret in the Woods",
	"mail.aelin1.text": "To @-^I apologize again for the...rather unseemly display when we met. I suppose I got too worked up seeing a human so far in the woods...no one seems to know my grove exists.^^As an apology, I've attached a simple medicine recipe that I use regularly. It's a potent painkiller that may be of good use to you in working the fields.^^   -Aelin",
	"mail.aelin2.text": "To @-^Thank you for visiting me yesterday. It's...rather nice, having company over. I suppose I should start preparing refreshments in case you come by again?^^I was digging through my old books and found this recipe. I don't get to make much use of it, since I don't go out enough to warrant using it. But, maybe you can use it.^^   -Aelin",
	"mail.aelin3.text": "Dear @,^You know, you coming over so frequently has been quite a blessing. Perhaps I'm imagining things, but I feel like I've got more energy than usual lately. Could it be because of your connection to the forest? Or perhaps it's just your sunny personality? I can't even guess.^^As thanks, I'd like to share this recipe with you. It's an old tonic rumored to foster a connection to nature. Unfortunately, I don't get to make it much...I can't grow strawberries to save my life.^^   -Aelin",
	"mail.aelin4.text": "Dearest @,^Since our first meeting, you've shown me nothing but kindness, and you've been so patient with me in spite of my weakness. I was terribly rude to you when you brought me to the clinic...if you hadn't, I may not be here now, and I'm truly sorry for how I treated you.^^You are a true friend of nature, and I want to give you a gift. This recipe is an ancient one, passed down from nature spirits to humanity as a gift of trust, and I wish for you to have it.^^May the blessings of nature follow you always.^^   -Your Friend, Aelin",
	"mail.aelin1.name": "A Gift from Aelin",
	"mail.aelin2.name": "Aelin's Appreciation",
	"mail.aelin3.name": "Aelin's Gratitude",
	"mail.aelin4.name": "A Friend of Nature",
	"mail.joja1.text": "",
	"mail.joja2.text": "",
	"mail.joja3.text": "",
	"mail.joja4.text": "",
	"mail.joja1.name": "A Tonic for Pain",
	"mail.joja2.name": "A Tonic for Energy",
	"mail.joja3.name": "A Tonic for Nature",
	"mail.joja4.name": "A Miracle Medicine",
	"mail.eq.text": "Farmer @,^How have you been? Aelin can't seem to stop talking about you and how often you visit him. I haven't seen him full of this much energy in a very long time!^^I want to surprise him with a little gift, if you would like to help. I'll need some tea leaves to start, if you could bring some. Don't tell him--it'll be our secret!^^   -Eugene",
	"mail.eq.name": "A Secret Gift",
	"mail.er.text": "Farmer @,^Thank you again for helping me prepare a gift for my old friend. The way his eyes lit up...he looked so happy, didn't he? He doesn't get to enjoy strawberries very often, even though they're his favorite.^^Here, I've attached the recipe for the tea we made for him as thanks, both for helping me and for being his friend.^^   -Eugene",
	"mail.eralt.text": "Farmer @,^How have you been lately? Things have been rather quiet in the forest...it's become rather lonely.^^I was thinking about the past, and I remembered an old tea recipe that I made for a friend, many years ago. I've attached it for you--perhaps you'll enjoy it as much as he did. I think I'll brew a cup in his memory...   -Eugene",
	"mail.er.name": "Strawberry Tea",
	
	// QUESTS
	"q01.name": "The Secret in the Woods",
	"q01.desc": "The Wizard mentioned that there's a hidden presence deep in the heart of Cindersap Forest...",
	"q01.hint": "Enter the Secret Grove.",
	"q.e.name": "A Secret Gift",
	"q.e.desc1": "Eugene wants to prepare a gift for Aelin with your help. First, he needs some Tea Leaves.",
	"q.e.desc2": "Eugene wants to prepare a gift for Aelin with your help. Next, he needs some Honey.",
	"q.e.desc3": "Eugene wants to prepare a gift for Aelin with your help. The secret ingredient seems to be a Strawberry...",
	"q.e.desc4": "Eugene wants to prepare a gift for Aelin with your help. He's got the gift ready, now it's time to deliver it!",
	"q.e.hint1": "Deliver 3 Tea Leaves to Eugene.",
	"q.e.hint2": "Deliver Honey to Eugene.",
	"q.e.hint3": "Deliver Strawberry to Eugene.",
	"q.e.hint4": "Enter Aelin's House between 6:00AM and 9:00PM.",
	"q.e.text1": "Oh, these look perfect, @! Fresh, tender, and the aroma is just right!$1#$b#Next, we'll need some Honey. One jar should be enough, I think.",
	"q.e.text2": "Ah, perfect! Nice golden honey, just what we need.$1#$b#Now for the secret ingredient...I need a nice ripe Strawberry. They're his favorite, after all.",
	"q.e.text3": "Mmm, I'm almost tempted to just give him this Strawberry right now! It looks amazing--he'd love it!$1#$b#Alright, I'll get started on the tea. It won't take very long.#$b#Why don't you go on ahead to Aelin's house? I'll catch up, and we can deliver it together.",
	
	// ITEMS
	"pain.name": "Pain Tonic",
	"pain.desc": "A potent painkiller made from poppies.",
	"energizing.name": "Energizing Tonic",
	"energizing.desc": "An all-natural energy drink made from fresh vegetables.",
	"sunshine.name": "Sunshine Tonic",
	"sunshine.desc": "A mysterious tonic that enhances connections with nature.",
	"ancient.name": "Ancient Tonic",
	"ancient.name": "A powerful, miraculous medicine that treats all wounds and heightens natural ability.",
	"sbtea.name": "Strawberry Tea",
	"sbtea.desc": "A sweet, soothing tea blended with strawberries and honey.",
	
	// MOVIES
	"dialogue.ticket.reject.invited": "O-oh, um...sorry, but {0} asked me to go already.#$b#Maybe next time?",
	"dialogue.ticket.reject.watched": "Ah...I think once is enough for me right now.#$b#We can go another time, though!",
	"dialogue.ticket.reject.dontWatch": "Mm...that doesn't sound too enjoyable.$2#$b#Sorry, maybe another time?",
	"dialogue.ticket.reject.divorced": "Leave me alone.$5#$b#I already can barely stand the sight of you.$5",
	
	// STRINGS
	"engagement0": "I still can't believe it...it's like a dream...$4",
	"engagement1": "I'm so nervous...this feeling, it's called \"butterflies\", yes?$4#$b#I can hardly wait...$4",
}
